{
    "MY_PROJECTS": "MY PROJECTS",
    "QUICK_INTRO": "QUICK INTRO TO SCRATCHJR",
    "SAMPLE_PROJECTS": "SAMPLE PROJECTS",
    "ABOUT_SCRATCHJR": "ABOUT SCRATCHJR",
    "INTERFACE_GUIDE": "INTERFACE GUIDE",
    "PAINT_EDITOR_GUIDE": "PAINT EDITOR GUIDE",
    "BLOCKS_GUIDE": "BLOCKS GUIDE",
    "PRIVACY_POLICY": "PRIVACY POLICY",
    "ABOUT_WHAT_IS": "WHAT IS SCRATCHJR?",
    "ABOUT_DESCRIPTION": "SCRATCHJR IS AN INTRODUCTORY PROGRAMMING LANGUAGE THAT ENABLES YOUNG CHILDREN (AGES 5-7) TO CREATE THEIR OWN INTERACTIVE STORIES AND GAMES. CHILDREN SNAP TOGETHER GRAPHICAL PROGRAMMING BLOCKS TO MAKE CHARACTERS MOVE, JUMP, DANCE, AND SING. CHILDREN CAN MODIFY CHARACTERS IN THE PAINT EDITOR, ADD THEIR OWN VOICES AND SOUNDS, EVEN INSERT PHOTOS OF THEMSELVES -- THEN USE THE PROGRAMMING BLOCKS TO MAKE THEIR CHARACTERS COME TO LIFE.",
    "ABOUT_INSPIRED_BY": "SCRATCHJR WAS INSPIRED BY THE POPULAR SCRATCH PROGRAMMING LANGUAGE (HTTP://SCRATCH.MIT.EDU), USED BY MILLIONS OF YOUNG PEOPLE (AGES 8 AND UP) AROUND THE WORLD. IN CREATING SCRATCHJR, WE REDESIGNED THE INTERFACE AND PROGRAMMING LANGUAGE TO MAKE THEM DEVELOPMENTALLY APPROPRIATE FOR YOUNGER CHILDREN, CAREFULLY DESIGNING FEATURES TO MATCH YOUNG CHILDREN'S COGNITIVE, PERSONAL, SOCIAL, AND EMOTIONAL DEVELOPMENT.<BR/><BR/>FOR MORE INFORMATION ABOUT SCRATCHJR, SEE HTTP://SCRATCHJR.ORG",
    "ABOUT_WHY_CREATE": "WHY DID WE CREATE SCRATCHJR?",
    "ABOUT_WHY_CREATE_DESCRIPTION": "CODING (OR COMPUTER PROGRAMMING) IS A NEW TYPE OF LITERACY. JUST AS WRITING HELPS YOU ORGANIZE YOUR THINKING AND EXPRESS YOUR IDEAS, THE SAME IS TRUE FOR CODING. IN THE PAST, CODING WAS SEEN AS TOO DIFFICULT FOR MOST PEOPLE. BUT WE THINK CODING SHOULD BE FOR EVERYONE, JUST LIKE WRITING.<BR/><BR/>AS YOUNG CHILDREN CODE WITH SCRATCHJR, THEY LEARN HOW TO CREATE AND EXPRESS THEMSELVES WITH THE COMPUTER, NOT JUST TO INTERACT WITH IT. IN THE PROCESS, CHILDREN LEARN TO SOLVE PROBLEMS AND DESIGN PROJECTS, AND THEY DEVELOP SEQUENCING SKILLS THAT ARE FOUNDATIONAL FOR LATER ACADEMIC SUCCESS. THEY ALSO USE MATH AND LANGUAGE IN A MEANINGFUL AND MOTIVATING CONTEXT, SUPPORTING THE DEVELOPMENT OF EARLY-CHILDHOOD NUMERACY AND LITERACY. WITH SCRATCHJR, CHILDREN AREN'T JUST LEARNING TO CODE, THEY ARE CODING TO LEARN.",
    "ABOUT_WHO_CREATED": "WHO CREATED SCRATCHJR?",
    "ABOUT_WHO_CREATED_DESCRIPTION": "SCRATCHJR IS A COLLABORATION BETWEEN THE DEVELOPMENTAL TECHNOLOGIES (DEVTECH) RESEARCH GROUP AT THE ELIOT-PEARSON DEPARTMENT OF CHILD STUDY AND HUMAN DEVELOPMENT AT TUFTS UNIVERSITY (LED BY MARINA UMASCHI BERS, WITH CONTRIBUTIONS FROM AMANDA STRAWHACKER, CLAIRE CAINE, LOUISE FLANNERY, ELIZABETH KAZAKOFF, AND DYLAN PORTELANCE), THE LIFELONG KINDERGARTEN GROUP AT THE MIT MEDIA LAB (LED BY MITCHEL RESNICK, WITH CONTRIBUTIONS FROM CHRIS GARRITY, TIM MICKEL, CARL BOWMAN, CHAMPIKA FERNANDO, NATALIE RUSK, SAYAMINDU DASGUPTA, AND CHRIS GRAVES), AND THE PLAYFUL INVENTION COMPANY (LED BY PAULA BONT&AACUTE; AND BRIAN SILVERMAN, WITH CONTRIBUTIONS FROM JACK GEDDES AND ADRIAN GABRIEL). THE ANDROID VERSION OF SCRATCHJR WAS IMPLEMENTED BY TWO SIGMA (LED BY MARK ROTH, WITH CONTRIBUTIONS FROM KEVIN HU), WITH INPUT FROM BENESSE CORP.<BR/> <BR/>THE GRAPHICS AND ILLUSTRATIONS FOR SCRATCHJR WERE CREATED BY HVINGTQUATRE COMPANY (LED BY JULIEN GELIFIER AND ADRIEN VALESA), SARAH THOMSON, PETER MUELLER, AND JILLIAN LOMBARDI. PAULA AGUILERA OF THE MIT MEDIA LAB PRODUCED THE SCRATCHJR VIDEO. WE WOULD ALSO LIKE TO THANK EVERYONE WHO PARTICIPATED IN THE BETA-TEST COMMUNITIES FOR IPAD AND ANDROID, PARTICULARLY SERGIO ANTOLINEZ, VANDENDAELE DIDIER, AND SJOERD DIRK MEIJER.",
    "ABOUT_WHO_SUPPORTED": "WHO SUPPORTED SCRATCHJR?",
    "ABOUT_WHO_SUPPORTED_DESCRIPTION": "THE SCRATCHJR PROJECT HAS RECEIVED GENEROUS FINANCIAL SUPPORT FROM THE NATIONAL SCIENCE FOUNDATION (NSF DRL-1118664), SCRATCH FOUNDATION, LEGO FOUNDATION, AND BRITISH TELECOMMUNICATIONS.<BR/><BR/>IF YOU ENJOY USING THIS FREE APP, PLEASE CONSIDER MAKING A DONATION TO THE SCRATCH FOUNDATION (WWW.SCRATCHFOUNDATION.ORG), A NONPROFIT ORGANIZATION THAT PROVIDES ONGOING SUPPORT FOR SCRATCHJR. WE APPRECIATE DONATIONS OF ALL SIZES, LARGE AND SMALL. <BR/><BR/>PLATINUM SUPPORTERS FROM THE SCRATCHJR KICKSTARTER CAMPAIGN: JEREMY DEUTSCH, KENNETH EHLERT, CATHERINE GREENSPON, MARK LOUGHRIDGE, JOANN GANTZ BENDETSON, AND SHIRLEY RESNICK.<BR/><BR/>OTHER SUPPORTERS FROM THE SCRATCHJR KICKSTARTER CAMPAIGN:",
    "BLOCKS_TRIGGERING_BLOCKS": "TRIGGERING BLOCKS",
    "BLOCKS_GREEN_FLAG": "START ON GREEN FLAG",
    "BLOCKS_GREEN_FLAG_DESCRIPTION": "STARTS THE SCRIPT WHEN THE GREEN FLAG IS TAPPED.",
    "BLOCKS_ON_TAP": "START ON TAP",
    "BLOCKS_ON_TAP_DESCRIPTION": "STARTS THE SCRIPT WHEN YOU TAP ON THE CHARACTER.",
    "BLOCKS_ON_TOUCH": "START ON TOUCH",
    "BLOCKS_ON_TOUCH_DESCRIPTION": "STARTS THE SCRIPT WHEN THE CHARACTER IS TOUCHED BY ANOTHER CHARACTER.",
    "BLOCKS_ON_MESSAGE": "START ON MESSAGE",
    "BLOCKS_ON_MESSAGE_DESCRIPTION": "STARTS THE SCRIPT WHENEVER A MESSAGE OF THE SPECIFIED COLOR IS SENT.",
    "BLOCKS_SEND_MESSAGE": "SEND MESSAGE",
    "BLOCKS_SEND_MESSAGE_DESCRIPTION": "SENDS A MESSAGE OF THE SPECIFIED COLOR.",
    "BLOCKS_MOTION_BLOCKS": "MOTION BLOCKS",
    "BLOCKS_MOVE_RIGHT": "MOVE RIGHT",
    "BLOCKS_MOVE_RIGHT_DESCRIPTION": "MOVES THE CHARACTER A SPECIFIED NUMBER OF GRID SQUARES TO THE RIGHT.",
    "BLOCKS_MOVE_LEFT": "MOVE LEFT",
    "BLOCKS_MOVE_LEFT_DESCRIPTION": "MOVES THE CHARACTER A SPECIFIED NUMBER OF GRID SQUARES TO THE LEFT.",
    "BLOCKS_MOVE_UP": "MOVE UP",
    "BLOCKS_MOVE_UP_DESCRIPTION": "MOVES THE CHARACTER A SPECIFIED NUMBER OF GRID SQUARES UP.",
    "BLOCKS_MOVE_DOWN": "MOVE DOWN",
    "BLOCKS_MOVE_DOWN_DESCRIPTION": "MOVES THE CHARACTER A SPECIFIED NUMBER OF GRID SQUARES DOWN.",
    "BLOCKS_TURN_RIGHT": "TURN RIGHT",
    "BLOCKS_TURN_RIGHT_DESCRIPTION": "ROTATES THE CHARACTER CLOCKWISE A SPECIFIED AMOUNT. TURN 12 FOR A FULL ROTATION.",
    "BLOCKS_TURN_LEFT": "TURN LEFT",
    "BLOCKS_TURN_LEFT_DESCRIPTION": "ROTATES THE CHARACTER COUNTERCLOCKWISE A SPECIFIED AMOUNT. TURN 12 FOR A FULL ROTATION.",
    "BLOCKS_HOP": "HOP",
    "BLOCKS_HOP_DESCRIPTION": "MOVES THE CHARACTER UP A SPECIFIED NUMBER OF GRID SQUARES AND THEN DOWN AGAIN.",
    "BLOCKS_GO_HOME": "GO HOME",
    "BLOCKS_GO_HOME_DESCRIPTION": "RESETS THE CHARACTER'S LOCATION TO ITS STARTING POSITION. (TO SET A NEW STARTING POSITION, DRAG THE CHARACTER TO THE LOCATION).",
    "BLOCKS_LOOKS_BLOCKS": "LOOKS BLOCKS",
    "BLOCKS_SAY": "SAY",
    "BLOCKS_SAY_DESCRIPTION": "SHOWS A SPECIFIED MESSAGE IN A SPEECH BUBBLE ABOVE THE CHARACTER.",
    "BLOCKS_GROW": "GROW",
    "BLOCKS_GROW_DESCRIPTION": "INCREASES THE CHARACTER'S SIZE.",
    "BLOCKS_SHRINK": "SHRINK",
    "BLOCKS_SHRINK_DESCRIPTION": "DECREASES THE CHARACTER'S SIZE.",
    "BLOCKS_RESET_SIZE": "RESET SIZE",
    "BLOCKS_RESET_SIZE_DESCRIPTION": "RETURNS THE CHARACTER TO ITS DEFAULT SIZE.",
    "BLOCKS_HIDE": "HIDE",
    "BLOCKS_HIDE_DESCRIPTION": "FADES OUT THE CHARACTER UNTIL IT IS INVISIBLE.",
    "BLOCKS_SHOW": "SHOW",
    "BLOCKS_SHOW_DESCRIPTION": "FADES IN THE CHARACTER UNTIL IT IS FULLY VISIBLE.",
    "BLOCKS_SOUND_BLOCKS": "SOUND BLOCKS",
    "BLOCKS_POP": "POP",
    "BLOCKS_POP_DESCRIPTION": "PLAYS A \"Pop\" SOUND",
    "BLOCKS_PLAY_RECORDED": "PLAY RECORDED SOUND",
    "BLOCKS_PLAY_RECORDED_DESCRIPTION": "PLAYS A SOUND RECORDED BY THE USER.",
    "BLOCKS_CONTROL_BLOCKS": "CONTROL BLOCKS",
    "BLOCKS_WAIT": "WAIT",
    "BLOCKS_WAIT_DESCRIPTION": "PAUSES THE SCRIPT FOR A SPECIFIED AMOUNT OF TIME (IN TENTHS OF SECONDS).",
    "BLOCKS_STOP": "STOP",
    "BLOCKS_STOP_DESCRIPTION": "STOPS ALL THE CHARACTERS' SCRIPTS.",
    "BLOCKS_SET_SPEED": "SET SPEED",
    "BLOCKS_SET_SPEED_DESCRIPTION": "CHANGES THE RATE AT WHICH CERTAIN BLOCKS ARE RUN.",
    "BLOCKS_REPEAT": "REPEAT",
    "BLOCKS_REPEAT_DESCRIPTION": "RUNS THE BLOCKS INSIDE A SPECIFIED NUMBER OF TIMES.",
    "BLOCKS_END_BLOCKS": "END BLOCKS",
    "BLOCKS_END": "END",
    "BLOCKS_END_DESCRIPTION": "INDICATES THE END OF THE SCRIPT (BUT DOES NOT AFFECT THE SCRIPT IN ANY WAY).",
    "BLOCKS_REPEAT_FOREVER": "REPEAT FOREVER",
    "BLOCKS_REPEAT_FOREVER_DESCRIPTION": "RUNS THE SCRIPT OVER AND OVER.",
    "BLOCKS_GO_TO_PAGE": "GO TO PAGE",
    "BLOCKS_GO_TO_PAGE_DESCRIPTION": "CHANGES TO THE SPECIFIED PAGE OF THE PROJECT.",
    "INTERFACE_GUIDE_NUMBER": "{N, NUMBER}",
    "INTERFACE_GUIDE_SAVE": "{N, NUMBER} | SAVE",
    "INTERFACE_GUIDE_STAGE": "{N, NUMBER} | STAGE",
    "INTERFACE_GUIDE_PRESENTATION_MODE": "{N, NUMBER} | PRESENTATION MODE",
    "INTERFACE_GUIDE_GRID": "{N, NUMBER} | GRID",
    "INTERFACE_GUIDE_CHANGE_BG": "{N, NUMBER} | CHANGE BACKGROUND",
    "INTERFACE_GUIDE_ADD_TEXT": "{N, NUMBER} | ADD TEXT",
    "INTERFACE_GUIDE_RESET_CHAR": "{N, NUMBER} | RESET CHARACTERS",
    "INTERFACE_GUIDE_GREEN_FLAG": "{N, NUMBER} | GREEN FLAG",
    "INTERFACE_GUIDE_PAGES": "{N, NUMBER} | PAGES",
    "INTERFACE_GUIDE_PROJECT_INFO": "{N, NUMBER} | PROJECT INFORMATION",
    "INTERFACE_GUIDE_UNDO_REDO": "{N, NUMBER} | UNDO AND REDO",
    "INTERFACE_GUIDE_PROGRAMMING_SCRIPT": "{N, NUMBER} | PROGRAMMING SCRIPT",
    "INTERFACE_GUIDE_PROGRAMMING_AREA": "{N, NUMBER} | PROGRAMMING AREA",
    "INTERFACE_GUIDE_BLOCKS_PALETTE": "{N, NUMBER} | BLOCKS PALETTE",
    "INTERFACE_GUIDE_BLOCKS_CATEGORIES": "{N, NUMBER} | BLOCK CATEGORIES",
    "INTERFACE_GUIDE_CHARACTERS": "{N, NUMBER} | CHARACTERS",
    "INTERFACE_GUIDE_SAVE_DESCRIPTION": "SAVE THE CURRENT PROJECT AND EXIT TO THE HOME PAGE.",
    "INTERFACE_GUIDE_STAGE_DESCRIPTION": "THIS IS WHERE THE ACTION TAKES PLACE IN THE PROJECT. TO DELETE A CHARACTER, PRESS AND HOLD IT.",
    "INTERFACE_GUIDE_PRESENTATION_MODE_DESCRIPTION": "EXPAND THE STAGE TO THE FULL SCREEN.",
    "INTERFACE_GUIDE_GRID_DESCRIPTION": "TOGGLE ON (AND OFF) THE X-Y COORDINATE GRID.",
    "INTERFACE_GUIDE_CHANGE_BG_DESCRIPTION": "SELECT OR CREATE A BACKGROUND IMAGE FOR THE STAGE.",
    "INTERFACE_GUIDE_ADD_TEXT_DESCRIPTION": "WRITE TITLES AND LABELS ON THE STAGE.",
    "INTERFACE_GUIDE_RESET_CHAR_DESCRIPTION": "RESET ALL CHARACTERS TO THEIR STARTING POSITIONS ON THE STAGE. (DRAG CHARACTERS TO SET UP NEW STARTING POSITIONS.)",
    "INTERFACE_GUIDE_GREEN_FLAG_DESCRIPTION": "START ALL PROGRAMMING SCRIPTS THAT BEGIN WITH A \"Start on Green Flag\" BLOCK BY TAPPING HERE.",
    "INTERFACE_GUIDE_PAGES_DESCRIPTION": "SELECT AMONG THE PAGES IN YOUR PROJECT \U2014 OR TAP THE PLUS SIGN TO ADD A NEW PAGE. EACH PAGE HAS ITS OWN SET OF CHARACTERS AND A BACKGROUND. TO DELETE A PAGE, PRESS AND HOLD IT. TO REORDER PAGES, DRAG THEM TO NEW POSITIONS.",
    "INTERFACE_GUIDE_PROJECT_INFO_DESCRIPTION": "CHANGE THE TITLE OF THE PROJECT, SEE WHEN THE PROJECT WAS CREATED, AND SHARE THE PROJECT (IF SUPPORTED BY YOUR DEVICE).",
    "INTERFACE_GUIDE_UNDO_REDO_DESCRIPTION": "IF YOU MAKE A MISTAKE, TAP UNDO TO GO BACK IN TIME, REVERSING THE LAST ACTION. TAP REDO TO REVERSE THE LAST UNDO.",
    "INTERFACE_GUIDE_PROGRAMMING_SCRIPT_DESCRIPTION": "SNAP BLOCKS TOGETHER TO MAKE A PROGRAMMING SCRIPT, TELLING THE CHARACTER WHAT TO DO. TAP ANYWHERE ON A SCRIPT TO MAKE IT RUN. TO DELETE A BLOCK OR SCRIPT, DRAG IT OUTSIDE THE PROGRAMMING AREA. TO COPY A BLOCK OR SCRIPT FROM ONE CHARACTER TO ANOTHER, DRAG IT ONTO THE CHARACTER'S THUMBNAIL.",
    "INTERFACE_GUIDE_PROGRAMMING_AREA_DESCRIPTION": "THIS IS WHERE YOU CONNECT PROGRAMMING BLOCKS TO CREATE SCRIPTS, TELLING THE CHARACTER WHAT TO DO.",
    "INTERFACE_GUIDE_BLOCKS_PALETTE_DESCRIPTION": "THIS IS THE MENU OF PROGRAMMING BLOCKS. DRAG A BLOCK INTO THE PROGRAMMING AREA, THEN TAP ON IT TO SEE WHAT IT DOES.",
    "INTERFACE_GUIDE_BLOCKS_CATEGORIES_DESCRIPTION": "THIS IS WHERE YOU CAN SELECT A CATEGORY OF PROGRAMMING BLOCKS: TRIGGERING BLOCKS (YELLOW), MOTION (BLUE), LOOKS (PURPLE), SOUNDS (GREEN), CONTROL (ORANGE), END BLOCKS (RED).",
    "INTERFACE_GUIDE_CHARACTERS_DESCRIPTION": "SELECT AMONG THE CHARACTERS IN YOUR PROJECT \U2014 OR TAP THE PLUS SIGN TO ADD A NEW ONE. ONCE A CHARACTER IS SELECTED, YOU CAN EDIT ITS SCRIPTS, TAP ITS NAME TO RENAME IT, OR TAP THE PAINTBRUSH TO EDIT ITS IMAGE. TO DELETE A CHARACTER, PRESS AND HOLD IT. TO COPY A CHARACTER TO ANOTHER PAGE, DRAG IT TO THE PAGE THUMBNAIL.",
    "PAINT_GUIDE_UNDO": "{N, NUMBER} | UNDO",
    "PAINT_GUIDE_REDO": "{N, NUMBER} | REDO",
    "PAINT_GUIDE_SHAPE": "{N, NUMBER} | SHAPE",
    "PAINT_GUIDE_CHARACTER_NAME": "{N, NUMBER} | CHARACTER NAME",
    "PAINT_GUIDE_CUT": "{N, NUMBER} | CUT",
    "PAINT_GUIDE_DUPLICATE": "{N, NUMBER} | DUPLICATE",
    "PAINT_GUIDE_ROTATE": "{N, NUMBER} | ROTATE",
    "PAINT_GUIDE_DRAG": "{N, NUMBER} | DRAG",
    "PAINT_GUIDE_SAVE": "{N, NUMBER} | SAVE",
    "PAINT_GUIDE_FILL": "{N, NUMBER} | FILL",
    "PAINT_GUIDE_CAMERA": "{N, NUMBER} | CAMERA",
    "PAINT_GUIDE_COLOR": "{N, NUMBER} | COLOR",
    "PAINT_GUIDE_LINE_WIDTH": "{N, NUMBER} | LINE WIDTH",
    "PAINT_GUIDE_UNDO_DESCRIPTION": "REVERSES THE MOST RECENT CHANGE.",
    "PAINT_GUIDE_REDO_DESCRIPTION": "REVERSES THE MOST RECENT UNDO.",
    "PAINT_GUIDE_SHAPE_DESCRIPTION": "CHOOSE A SHAPE TO DRAW: LINE, CIRCLE/ELLIPSE, RECTANGLE, OR TRIANGLE.",
    "PAINT_GUIDE_CHARACTER_NAME_DESCRIPTION": "EDIT THE NAME OF THE CHARACTER.",
    "PAINT_GUIDE_CUT_DESCRIPTION": "AFTER SELECTING THE CUT TOOL, YOU CAN TAP A CHARACTER OR SHAPE TO REMOVE IT FROM THE CANVAS.",
    "PAINT_GUIDE_DUPLICATE_DESCRIPTION": "AFTER SELECTING THE DUPLICATE TOOL, YOU CAN TAP A CHARACTER OR SHAPE TO CREATE A COPY OF IT.",
    "PAINT_GUIDE_ROTATE_DESCRIPTION": "AFTER SELECTING THE ROTATE TOOL, YOU CAN ROTATE A CHARACTER OR SHAPE AROUND ITS CENTER.",
    "PAINT_GUIDE_DRAG_DESCRIPTION": "AFTER SELECTING THE DRAG TOOL, YOU CAN DRAG A CHARACTER OR SHAPE ON THE CANVAS. IF YOU TAP ON A SHAPE, YOU CAN THEN EDIT THE SHAPE BY DRAGGING THE DOTS THAT APPEAR.",
    "PAINT_GUIDE_SAVE_DESCRIPTION": "SAVE CHANGES AND LEAVE THE PAINT EDITOR.",
    "PAINT_GUIDE_FILL_DESCRIPTION": "AFTER SELECTING THE FILL TOOL, YOU CAN TAP ANY SECTION OF A CHARACTER OR SHAPE TO FILL IT WITH THE CURRENTLY SELECTED COLOR.",
    "PAINT_GUIDE_CAMERA_DESCRIPTION": "AFTER SELECTING THE CAMERA TOOL, YOU CAN TAP ANY SECTION OF A CHARACTER OR SHAPE, AND THEN TAP THE CAMERA BUTTON TO FILL THE SECTION WITH A NEW PHOTO TAKEN WITH THE CAMERA.",
    "PAINT_GUIDE_COLOR_DESCRIPTION": "SELECT A NEW COLOR TO USE FOR DRAWING AND FILLING IN SHAPES.",
    "PAINT_GUIDE_LINE_WIDTH_DESCRIPTION": "CHANGE THE WIDTH OF THE LINES IN THE SHAPES YOU ARE DRAWING.",
    "PRIVACY_TITLE": "SCRATCHJR PRIVACY POLICY",
    "PRIVACY_LAST_UPDATED": "THE SCRATCHJR PRIVACY POLICY WAS LAST UPDATED: NOVEMBER 3RD, 2021",
    "PRIVACY_HIGHLIGHT": "SCRATCH CARES ABOUT YOUR PRIVACY. THIS DOCUMENT, CALLED A \"privacy policy\", EXPLAINS WHAT INFORMATION WE COLLECT FROM YOU, HOW WE COLLECT IT, WHY WE COLLECT IT, AND HOW WE KEEP IT SAFE. IT ALSO TELLS YOU ABOUT THE CHOICES AND OPTIONS YOU HAVE ABOUT YOUR INFORMATION.",
    "PRIVACY_DESCRIPTION": "THE SCRATCH FOUNDATION, AND ASSOCIATED ENTITIES (COLLECTIVELY, \"<b>SCRATCH</b>\", \"<b>WE</b>\", \"<b>OUR</b>\" OR \"<b>US</b>\") UNDERSTAND HOW IMPORTANT PRIVACY IS TO OUR COMMUNITY, ESPECIALLY KIDS AND PARENTS (\"<b>YOU</b>\" OR \"<b>USER</b>\"). WE WROTE THIS PRIVACY POLICY (\"<b>Privacy Policy</b>\") TO EXPLAIN WHAT INFORMATION WE COLLECT THROUGH THE SCRATCHJR MOBILE APPLICATION (THE \"<b>app</b>\"), HOW WE USE, PROCESS, AND SHARE IT, AND WHAT WE ARE DOING TO KEEP IT SAFE. IT ALSO TELLS YOU ABOUT YOUR RIGHTS AND CHOICES WITH RESPECT TO YOUR PERSONAL INFORMATION, AND HOW YOU CAN CONTACT US IF YOU HAVE ANY QUESTIONS OR CONCERNS.<BR>PLEASE READ THIS PRIVACY POLICY CAREFULLY SO THAT YOU UNDERSTAND YOUR RIGHTS IN RELATION TO YOUR PERSONAL INFORMATION, AND HOW WE WILL COLLECT, USE AND PROCESS YOUR PERSONAL INFORMATION. IF YOU DO NOT AGREE WITH THIS PRIVACY POLICY OR ANY PART THEREOF, YOU SHOULD NOT ACCESS OR USE ANY PART OF THE APP. IF YOU CHANGE YOUR MIND IN THE FUTURE, YOU MUST STOP USING THE APP AND YOU MAY EXERCISE YOUR RIGHTS IN RELATION TO YOUR PERSONAL INFORMATION AS SET OUT IN THIS PRIVACY POLICY.",
    "PRIVACY_INFORMATION_COLLECTED": "WHAT PERSONAL INFORMATION DOES THE SCRATCHJR TEAM COLLECT ABOUT ME?",
    "PRIVACY_INFORMATION_COLLECTED_HIGHLIGHT": "SCRATCH COLLECTS AND STORES INFORMATION YOU PROVIDE TO US, FOR EXAMPLE WHETHER YOU WANT TO USE THE APP AT HOME OR FOR SCHOOL AND IN WHAT LANGUAGE. THE APP AUTOMATICALLY COLLECTS SOME INFORMATION ABOUT THE TABLET OR PHONE ON WHICH YOU USE THE APP AND ABOUT HOW YOU PLAY ON THE APP. ",
    "PRIVACY_INFORMATION_COLLECTED_DESCRIPTION": "FOR THE PURPOSE OF THIS PRIVACY POLICY, “PERSONAL INFORMATION” MEANS ANY INFORMATION RELATING TO AN IDENTIFIED OR IDENTIFIABLE INDIVIDUAL. WE OBTAIN PERSONAL INFORMATION RELATING TO YOU FROM VARIOUS SOURCES DESCRIBED BELOW.<BR>WHERE APPLICABLE, WE INDICATE WHETHER AND WHY YOU MUST PROVIDE US WITH YOUR PERSONAL INFORMATION, AS WELL AS THE CONSEQUENCES OF FAILING TO DO SO. IF YOU DO NOT PROVIDE PERSONAL INFORMATION WHEN REQUESTED, YOU MAY NOT BE ABLE TO BENEFIT FROM OUR APP IF THAT INFORMATION IS NECESSARY TO PROVIDE YOU WITH THE APP OR IF WE ARE LEGALLY REQUIRED TO COLLECT THE INFORMATION.",
    "PRIVACY_INFO_FROM_YOU": "INFORMATION PROVIDED BY YOU",
    "PRIVACY_INFO_FROM_PROJECT": "<B>PROJECTS.</B> THE APP COLLECTS THE PROJECTS THAT YOU MAY CREATE ON THE APP, INCLUDING PICTURES OR SOUND RECORDINGS FEATURES IN PROJECTS. HOWEVER, THIS INFORMATION IS ONLY STORED LOCALLY ON YOUR DEVICE AND IS NOT TRANSMITTED TO OR ACCESSIBLE BY SCRATCH. WHEN YOU FIRST DOWNLOAD THE APP, WE ASK PERMISSION TO ACCESS THE CAMERA (TO ENABLE YOU TO TAKE PICTURES TO USE AS CHARACTERS IN YOUR PROJECTS) AND THE MICROPHONE (TO RECORD SOUNDS TO USE IN YOUR PROJECTS) OF YOUR DEVICE. YOU CAN DISABLE THESE FEATURES AT ANY TIME IN THE APP SETTINGS PROVIDED BY YOUR DEVICE. ",
    "PRIVACY_INFO_FROM_PREFS": "<B>USE PREFERENCES.</B> WE ASK YOU WHETHER YOU WILL USE THE APP FOR SCHOOL, AT HOME, OR FOR ANOTHER REASON AND WHAT LANGUAGE YOU WOULD LIKE US TO DISPLAY THE APP IN. ",
    "PRIVACY_INFO_FROM_AUTO": "INFORMATION COLLECTED VIA AUTOMATED MEANS",
    "PRIVACY_INFO_FROM_USAGE": "<B>DEVICE AND USAGE INFORMATION.</B> WHEN YOU USE OUR APP, WE AND THIRD PARTIES MAY AUTOMATICALLY COLLECT YOUR IP ADDRESS AT COUNTRY LEVEL AND INFORMATION ABOUT YOUR DEVICE INCLUDING MODEL, VERSION AND OPERATING SYSTEM.",
    "PRIVACY_USAGE": "HOW DOES THE SCRATCHJR TEAM USE MY PERSONAL INFORMATION?",
    "PRIVACY_USAGE_HIGHLIGHT": "WE COLLECT YOUR INFORMATION TO MAKE ALL THE FEATURES OF THE APP AVAILABLE TO YOU AND SUPPORT YOUR LEARNING, TO HELP US, EDUCATORS AND UNIVERSITIES LEARN ABOUT HOW CHILDREN PLAY AND LEARN THROUGH THE APP, TO HELP US IMPROVE THE APP AND TO DEFEND OUR RIGHTS. ",
    "PRIVACY_USAGE_DESCRIPTION": "WE MAY USE THE PERSONAL INFORMATION FOR ONE OR MORE OF THE FOLLOWING PURPOSES:",
    "PRIVACY_USAGE_FOR_SERVICE": "<B>PROVIDING YOU WITH THE SERVICES ON THE APP.</B> WE USE PERSONAL INFORMATION FOR INTERNAL AND APP-RELATED PURPOSES, INCLUDING TO OPERATE, PROVIDE, AND MAINTAIN THE APP. IN PARTICULAR WE WILL USE YOUR PERSONAL INFORMATION TO PERFORM OUR CONTRACTUAL OBLIGATION TOWARDS YOU TO ALLOW YOU TO USE THE APP, TO CONTACT YOU IN CASE OF ANY ISSUE WITH THE APP AND MAKE THE APP AVAILABLE TO YOU IN THE LANGUAGE THAT YOU SELECT IN THE APP SETTINGS. THE PERSONAL INFORMATION WE PROCESS WHEN DOING SO INCLUDES ANY CONTENT YOU CREATE ON THE APP AND YOUR LANGUAGE PREFERENCE.",
    "PRIVACY_USAGE_FOR_ANALYTICS": "<B>ANALYTICS AND IMPROVING THE APP.</B> WE AND OUR SERVICE PROVIDERS USE PERSONAL INFORMATION THAT WE COLLECT ON THE APP, SUCH AS YOUR LOCATION, WHICH CHARACTERS YOU USE THE MOST, HOW MUCH TIME YOU SPEND IN THE APP AND OTHER ACTIVITIES ON THE APP TO MONITOR AND ANALYZE USAGE OF THE APP AND TO IMPROVE AND ENHANCE THE APP. IT IS IN OUR LEGITIMATE INTEREST TO IMPROVE OUR APP FOR OUR USERS, WHICH INCLUDES CONDUCTING TROUBLESHOOTING, TESTING AND RESEARCH AND TO KEEP THE APP SECURE. WHEN DOING SO WE MAY USE PERSONAL INFORMATION THAT WE AUTOMATICALLY COLLECT ABOUT YOU, SUCH AS INFORMATION ON USE.",
    "PRIVACY_USAGE_FOR_DATA": "<B>AGGREGATING DATA.</B> WE MAY DE-IDENTIFY AND AGGREGATE INFORMATION COLLECTED THROUGH THE APP FOR STATISTICAL ANALYSIS AND OTHER LAWFUL PURPOSES, INCLUDING IN RESEARCH STUDIES INTENDED TO IMPROVE OUR UNDERSTANDING OF HOW PEOPLE LEARN WITH SCRATCHJR. AGGREGATED DATA MAY BE DERIVED FROM YOUR PERSONAL INFORMATION BUT IS NOT PERSONAL INFORMATION AS THIS DATA WILL NOT DIRECTLY OR INDIRECTLY REVEAL YOUR IDENTITY.",
    "PRIVACY_USAGE_FOR_LEGAL": "<B>LEGAL.</B> WE MAY USE YOUR PERSONAL INFORMATION TO ENFORCE OUR END USER LICENSE AGREEMENT (EULA), TO DEFEND OUR LEGAL RIGHTS, AND TO COMPLY WITH OUR LEGAL OBLIGATIONS AND INTERNAL POLICIES. ",
    "PRIVACY_USAGE_IN_EEA": "OUR USE OF EUROPEAN PERSONAL INFORMATION",
    "PRIVACY_USAGE_IN_EEA_HIGHLIGHT": "IF YOU ARE IN THE EEA, THE UK OR SWITZERLAND, WE ONLY USE YOUR INFORMATION WHEN WE HAVE A GROUND THAT ALLOWS US TO DO SO.",
    "PRIVACY_USAGE_IN_EEA_DESCRIPTION": "IF YOU ARE LOCATED IN THE EUROPEAN ECONOMIC AREA (“<B>EEA</B>”), THE UK OR SWITZERLAND WE ONLY PROCESS YOUR PERSONAL INFORMATION WHEN WE HAVE A VALID LEGAL BASIS:",
    "PRIVACY_USAGE_IN_EEA_CONTRACTUAL_NECESSITY": "<B>CONTRACTUAL NECESSITY.</B> WE MAY USE YOUR PERSONAL INFORMATION TO PERFORM OUR CONTRACTUAL OBLIGATIONS TOWARDS YOU. FOR EXAMPLE, WE NEED YOUR PERSONAL INFORMATION TO PROVIDE OUR SERVICES ON THE APP.",
    "PRIVACY_USAGE_IN_EEA_LEGITIMATE_INTEREST": "<B>LEGITIMATE INTEREST.</B> WE MAY USE YOUR PERSONAL INFORMATION WHEN WE OR A THIRD PARTY HAVE A LEGITIMATE INTEREST IN DOING SO. IN PARTICULAR, WE HAVE A LEGITIMATE INTEREST IN USING YOUR PERSONAL INFORMATION TO PROVIDE THE APP IN YOUR PREFERRED LANGUAGE, IMPROVE THE SAFETY, SECURITY, AND PERFORMANCE OF OUR APP, AND UNDERSTAND HOW THE APP IS USED, INCLUDING THROUGH RESEARCH STUDIES THAT HELP US UNDERSTAND HOW PEOPLE LEARN WITH SCRATCHJR. WE ONLY RELY ON OUR OR A THIRD PARTY’S LEGITIMATE INTERESTS TO PROCESS YOUR PERSONAL INFORMATION WHEN THESE INTERESTS ARE NOT OVERRIDDEN BY YOUR RIGHTS AND INTERESTS. ",
    "PRIVACY_USAGE_IN_EEA_LEGAL_OBLIGATION": "<B>LEGAL OBLIGATION.</B> WE MAY USE YOUR PERSONAL INFORMATION WHEN WE ARE LEGALLY REQUIRED TO. FOR EXAMPLE, TO COMPLY WITH TAX AND ACCOUNTING OBLIGATIONS, OR TO COMPLY WITH A COURT ORDER.",
    "PRIVACY_USAGE_IN_EEA_CONSENT": "<B>CONSENT.</B> WE MAY USE YOUR PERSONAL INFORMATION WHEN YOU HAVE CONSENTED TO DO SO.",
    "PRIVACY_SHARING": "HOW DOES THE SCRATCHJR TEAM SHARE MY PERSONAL INFORMATION?",
    "PRIVACY_SHARING_HIGHLIGHT": "WE ONLY SHARE YOUR INFORMATION WITH OTHER ORGANIZATIONS WHEN WE NEED TO. WE SHARE INFORMATION WITH VENDORS THAT HELP US PROVIDE THE APP. WE ALSO SHARE THE RESULTS OF THE RESEARCH WE DO WITH SCHOOLS AND RESEARCHERS, BUT WE FIRST TAKE STEPS TO PUT THAT INFORMATION IN A FORMAT THAT DOES NOT ALLOW THEM TO IDENTIFY YOU. WE MAY ALSO SHARE YOUR INFORMATION WITH COURTS AND GOVERNMENTS FOR LEGAL REASONS. ",
    "PRIVACY_SHARING_DESCRIPTION": "WE DISCLOSE YOUR PERSONAL INFORMATION TO THIRD PARTIES IN THE FOLLOWING CIRCUMSTANCES:",
    "PRIVACY_SHARING_WITH_SERVICE_PROVIDER": "<B>SERVICE PROVIDERS.</B> WE RELY ON SERVICE PROVIDERS FOR THE PROVISION OF THE SERVICES ON OUR APP, SUCH AS: GOOGLE FIREBASE, AN ANALYTICS PROVIDER, TO HELP US TO UNDERSTAND OUR USER BASE AND HOW OUR APP IS USED. ",
    "PRIVACY_SHARING_WITH_EDUCATION": "<B>EDUCATION AND RESEARCH INSTITUTIONS.</B> WE MAY SHARE THE RESULTS OF OUR RESEARCH ON CHILDREN’S EDUCATION THROUGH SCRATCHJR, IN A DE-IDENTIFIED AND AGGREGATE FORM, WITH EDUCATORS AND RESEARCH INSTITUTIONS, SUCH AS TUFTS UNIVERSITY AND MIT, THROUGH CONFERENCES, JOURNALS, AND OTHER PUBLICATIONS.",
    "PRIVACY_SHARING_WITH_CHANGE_OF_OWNERSHIP": "<B>CHANGE OF CORPORATE OWNERSHIP.</B> WE MAY DISCLOSE YOUR PERSONAL INFORMATION TO A POTENTIAL OR ACTUAL ACQUIRER, SUCCESSOR, OR ASSIGNEE AS PART OF ANY REORGANIZATION, MERGER, SALE, JOINT VENTURE, ASSIGNMENT, TRANSFER, OR OTHER DISPOSITION OF ALL OR ANY PORTION OF OUR ORGANIZATION OR ASSETS. ",
    "PRIVACY_SHARING_WITH_SCRATCH_GROUP": "<B>SCRATCH GROUP.</B> WE SHARE PERSONAL INFORMATION ABOUT YOU WITH OUR AFFILIATES AND SUBSIDIARIES.",
    "PRIVACY_SHARING_WITH_LEGAL": "<B>LEGAL.</B> WE MAY DISCLOSE YOUR PERSONAL INFORMATION IF REQUIRED TO DO SO BY LAW OR IN THE GOOD FAITH BELIEF THAT SUCH ACTION IS APPROPRIATE: (A) UNDER APPLICABLE LAW, INCLUDING LAWS OUTSIDE YOUR COUNTRY OF RESIDENCE; (B) TO COMPLY WITH LEGAL PROCESSES; (C) TO RESPOND TO REQUESTS FROM PUBLIC AND GOVERNMENT AUTHORITIES, SUCH AS SCHOOL, SCHOOL DISTRICTS, AND LAW ENFORCEMENT, INCLUDING PUBLIC AND GOVERNMENT AUTHORITIES OUTSIDE YOUR COUNTRY OF RESIDENCE; (D) TO ENFORCE OUR TERMS AND CONDITIONS; (E) TO PROTECT OUR OPERATIONS OR THOSE OF ANY OF OUR AFFILIATES; (F) TO PROTECT OUR RIGHTS, PRIVACY, SAFETY, OR PROPERTY, AND/OR THAT OF OUR AFFILIATES, YOU, OR OTHERS; AND (G) TO ALLOW US TO PURSUE AVAILABLE REMEDIES OR LIMIT THE DAMAGES THAT WE MAY SUSTAIN.",
    "PRIVACY_SHARING_WITH_CONSENT": "<B>CONSENT.</B> WE MAY ALSO DISCLOSE YOUR PERSONAL INFORMATION WITH YOUR PERMISSION. WE MAY SEEK YOUR PERMISSION IN VARIOUS WAYS.",
    "PRIVACY_YOUR_RIGHTS": "YOUR RIGHTS AND CHOICES",
    "PRIVACY_YOUR_RIGHTS_HIGHLIGHT": "IF YOU’RE INTERESTED IN HOW WE GET AND USE YOUR INFORMATION, YOU CAN CONTACT US IN ANY OF THE WAYS EXPLAINED BELOW UNDER “CONTACT US” OR SPEAK TO YOUR PARENTS, WHO WILL BE ABLE TO HELP YOU AND ANSWER ANY QUESTIONS THAT YOU HAVE. IF YOU HAVE ANY QUESTIONS ABOUT HOW WE PROCESS YOUR PERSONAL INFORMATION, PLEASE CONTACT US. ",
    "PRIVACY_YOUR_RIGHTS_DESCRIPTION": "WE STRIVE TO PROVIDE YOU WITH CHOICES REGARDING THE PERSONAL INFORMATION YOU PROVIDE TO US. WE HAVE CREATED MECHANISMS TO PROVIDE YOU WITH THE FOLLOWING CONTROL OVER YOUR PERSONAL INFORMATION:",
    "PRIVACY_YOUR_RIGHTS_DELETING": "<B>DELETING YOUR INFORMATION.</B> YOU CAN DELETE YOUR PROJECTS BY DELETING THE APP FROM YOUR DEVICE.",
    "PRIVACY_YOUR_RIGHTS_IN_EU": "YOUR EUROPEAN DATA PROTECTION RIGHTS",
    "PRIVACY_YOUR_RIGHTS_IN_EU_HIGHLIGHT": "IF YOU ARE IN THE EEA, THE UK OR SWITZERLAND, YOU AND YOUR PARENTS HAVE THE RIGHT TO: <UL><LI>BE TOLD HOW WE USE YOUR INFORMATION. </LI><LI>ASK TO SEE THE INFORMATION WE HAVE ABOUT YOU. </LI><LI>ASK US TO CHANGE INFORMATION YOU THINK IS WRONG.</LI><LI>ASK US TO REMOVE INFORMATION WHEN IT’S NOT NEEDED ANYMORE.</LI><LI>ASK US TO ONLY USE YOUR INFORMATION IN CERTAIN WAYS.</LI><LI>TELL US YOU DON’T WANT YOUR INFORMATION TO BE PROCESSED.</LI><LI>IF THE INFORMATION WE ARE COLLECTING IS INFORMATION THAT YOU CAN CHOOSE NOT TO GIVE, YOU CAN TELL US TO STOP COLLECTING IT AT ANY TIME.</LI></UL>IF YOU’RE INTERESTED IN HOW WE GET AND USE YOUR INFORMATION, YOU CAN CONTACT US IN ANY OF THE WAYS EXPLAINED BELOW UNDER “CONTACT US” OR SPEAK TO YOUR PARENTS, WHO WILL BE ABLE TO HELP YOU AND ANSWER ANY QUESTIONS THAT YOU HAVE. IF YOU ARE IN THE EEA, THE UK OR SWITZERLAND, YOU MAY ALSO SUBMIT A COMPLAINT WITH THE RELEVANT AUTHORITY.",
    "PRIVACY_YOUR_RIGHTS_IN_EU_DESCRIPTION": "IF YOU ARE IN THE EEA, THE UK OR SWITZERLAND, YOU HAVE THE RIGHT TO REQUEST ACCESS AND RECEIVE INFORMATION ABOUT THE PERSONAL INFORMATION WE MAINTAIN ABOUT YOU, TO UPDATE AND CORRECT INACCURACIES IN YOUR PERSONAL INFORMATION, TO RESTRICT OR OBJECT TO THE PROCESSING OF YOUR PERSONAL INFORMATION, TO HAVE THE INFORMATION BLOCKED, ANONYMIZED, OR DELETED, AS APPROPRIATE, OR TO EXERCISE YOUR RIGHT TO DATA PORTABILITY TO EASILY TRANSFER YOUR PERSONAL INFORMATION TO ANOTHER COMPANY. THOSE RIGHTS MAY BE LIMITED IN SOME CIRCUMSTANCES BY LOCAL LAW REQUIREMENTS. IN ADDITION TO THE ABOVE-MENTIONED RIGHTS, YOU ALSO HAVE THE RIGHT TO LODGE A COMPLAINT WITH THE INFORMATION COMMISSIONER’S OFFICE IN THE UK OR THE DATA PROTECTION SUPERVISORY AUTHORITY IN THE EU COUNTRY IN WHICH YOU LIVE OR WORK, OR WHERE YOU BELIEVE WE HAVE INFRINGED DATA PROTECTION LAWS.<BR><BR>IF WE RELY ON CONSENT FOR THE PROCESSING OF YOUR PERSONAL INFORMATION, YOU HAVE THE RIGHT TO WITHDRAW IT AT ANY TIME AND FREE OF CHARGE. WHEN YOU DO SO, THIS WILL NOT AFFECT THE LAWFULNESS OF THE PROCESSING BEFORE YOUR CONSENT WITHDRAWAL.<BR><BR>PLEASE NOTE THAT WE MAY HAVE VALID LEGAL REASONS TO REFUSE YOUR REQUEST AND WILL INFORM YOU IF THAT IS THE CASE. FOR MORE INFORMATION ON YOUR RIGHTS, OR TO SUBMIT A REQUEST TO EXERCISE YOUR RIGHTS UNDER APPLICABLE LAW, PLEASE CONTACT US AS INDICATED IN THE ‘CONTACT US’ SECTION BELOW.",
    "PRIVACY_DATA_RETENSION": "DATA RETENTION",
    "PRIVACY_DATA_RETENSION_HIGHLIGHT": "WE DON'T KEEP YOUR INFORMATION FOREVER. WE ONLY KEEP IT FOR AS LONG AS WE NEED IT TO HELP US DO THE ACTIVITIES EXPLAINED IN THIS POLICY.",
    "PRIVACY_DATA_RETENSION_DESCRIPTION": "WE TAKE MEASURES TO DELETE YOUR PERSONAL INFORMATION OR KEEP IT IN A FORM THAT DOES NOT ALLOW YOU TO BE IDENTIFIED WHEN THIS INFORMATION IS NO LONGER NECESSARY FOR THE PURPOSES FOR WHICH WE PROCESS IT, UNLESS WE ARE REQUIRED BY LAW TO KEEP THIS INFORMATION FOR A LONGER PERIOD. WHEN DETERMINING THE RETENTION PERIOD, WE TAKE INTO ACCOUNT VARIOUS CRITERIA, SUCH AS THE TYPE OF SERVICES REQUESTED BY OR PROVIDED TO YOU, THE NATURE AND LENGTH OF OUR RELATIONSHIP WITH YOU, POSSIBLE RE-ENROLLMENT WITH OUR SERVICES, THE IMPACT ON THE SERVICES WE PROVIDE TO YOU IF WE DELETE SOME INFORMATION FROM OR ABOUT YOU, MANDATORY RETENTION PERIODS PROVIDED BY LAW AND THE STATUTE OF LIMITATIONS.",
    "PRIVACY_INFO_PROTECTION": "HOW DOES THE SCRATCHJR TEAM PROTECT MY PERSONAL INFORMATION?",
    "PRIVACY_INFO_PROTECTION_HIGHLIGHT": "WE TAKE STEPS TO KEEP YOUR INFORMATION SAFE AND SECURE.",
    "PRIVACY_INFO_PROTECTION_DESCRIPTION": "WE HAVE IN PLACE ADMINISTRATIVE, PHYSICAL, AND TECHNICAL PROCEDURES THAT ARE INTENDED TO PROTECT THE INFORMATION WE COLLECT ON THE APP AGAINST ACCIDENTAL OR UNLAWFUL DESTRUCTION, ACCIDENTAL LOSS, UNAUTHORIZED ALTERATION, UNAUTHORIZED DISCLOSURE OR ACCESS, MISUSE, AND ANY OTHER UNLAWFUL FORM OF PROCESSING OF THE PERSONAL INFORMATION IN OUR POSSESSION. HOWEVER, AS EFFECTIVE AS THESE MEASURES ARE, NO SECURITY SYSTEM IS IMPENETRABLE. WE CANNOT COMPLETELY GUARANTEE THE SECURITY OF OUR DATABASES, NOR CAN WE GUARANTEE THAT THE INFORMATION YOU SUPPLY WILL NOT BE INTERCEPTED WHILE BEING TRANSMITTED TO US OVER THE INTERNET.",
    "PRIVACY_NOTIFICATIONS_OF_CHANGE": "NOTIFICATIONS OF CHANGES TO THE PRIVACY POLICY",
    "PRIVACY_NOTIFICATIONS_OF_CHANGE_HIGHLIGHT": "IF WE MAKE ANY CHANGES TO HOW WE USE YOUR INFORMATION, WE WILL UPDATE THIS PRIVACY POLICY THROUGH THE APP AND MAY LET YOU KNOW THAT WE HAVE MADE CHANGES. ",
    "PRIVACY_NOTIFICATIONS_OF_CHANGE_DESCRIPTION": "WE REVIEW PRIVACY POLICY ON A PERIODIC BASIS, AND WE MAY MODIFY OUR POLICIES AS APPROPRIATE. IF WE MAKE MATERIAL CHANGES, WE WILL NOTIFY YOU THEREOF. WE ENCOURAGE YOU TO REVIEW OUR PRIVACY POLICY ON A REGULAR BASIS. THE “LAST UPDATED” DATE AT THE TOP OF THIS PAGE INDICATES WHEN THIS PRIVACY POLICY WAS LAST REVISED. YOUR CONTINUED USE OF THE APP FOLLOWING THESE CHANGES MEANS THAT YOU ACCEPT THE REVISED PRIVACY POLICY.",
    "PRIVACY_INTERNATIONAL_DATA_TRANSFER": "INTERNATIONAL CROSS-BORDER DATA TRANSFER",
    "PRIVACY_INTERNATIONAL_DATA_TRANSFER_HIGHLIGHT": "YOUR INFORMATION WILL BE STORED AND USED BY SCRATCH IN THE UNITED STATES, WHERE THE LAWS AND PROTECTIONS OF YOUR INFORMATION MAY BE DIFFERENT THAN IN YOUR COUNTRY. WE TAKE STEPS TO KEEP YOUR INFORMATION SAFE AND SECURE.",
    "PRIVACY_INTERNATIONAL_DATA_TRANSFER_DESCRIPTION": "WE MAY TRANSFER THE PERSONAL INFORMATION THAT WE COLLECT ABOUT YOU TO RECIPIENTS IN COUNTRIES OTHER THAN THE COUNTRY IN WHICH THE PERSONAL INFORMATION ORIGINALLY WAS COLLECTED.  THOSE COUNTRIES MAY NOT HAVE THE SAME DATA PROTECTION LAWS AS THE COUNTRY IN WHICH YOU INITIALLY PROVIDED THE PERSONAL INFORMATION.<BR>SCRATCH IS BASED IN THE UNITED STATES. IF YOU PROVIDE US WITH YOUR PERSONAL INFORMATION WHEN USING THE SERVICES FROM THE EEA, SWITZERLAND OR THE UK, PLEASE NOTE THAT YOU ARE TRANSFERRING YOUR PERSONAL INFORMATION OUTSIDE OF THOSE REGIONS TO THE UNITED STATES FOR STORAGE AND PROCESSING.",
    "PRIVACY_CONTACT": "CONTACT US",
    "PRIVACY_CONTACT_HIGHLIGHT": "PLEASE WRITE TO US OR EMAIL US USING THE CONTACT DETAILS SET OUT BELOW. ",
    "PRIVACY_CONTACT_DESCRIPTION": "THE CODE-TO-LEARN FOUNDATION D/B/A THE SCRATCH FOUNDATION IS THE ENTITY RESPONSIBLE FOR THE PROCESSING OF YOUR PERSONAL INFORMATION AND FOR THE PURPOSE OF THE EU AND UK GENERAL DATA PROTECTION REGULATION (GDPR), IS THE DATA CONTROLLER IN RESPECT OF THE PROCESSING OF YOUR PERSONAL INFORMATION. IF YOU HAVE ANY QUESTIONS ABOUT THIS PRIVACY POLICY, OR IF YOU WOULD LIKE TO EXERCISE YOUR RIGHTS TO YOUR PERSONAL INFORMATION, YOU MAY CONTACT US AT HELP@SCRATCH.MIT.EDU OR VIA MAIL AT:<BR><BR><B>SCRATCH FOUNDATION<B><BR><B>ATTN: PRIVACY POLICY</B><BR><B>7315 WISCONSIN AVE.</B><BR><B>4TH FLOOR WEST</B><BR><B>BETHESDA, MD 20814</B>",
    "SAMPLE_UNDER THE SEA": "UNDER THE SEA",
    "SAMPLE_FARM": "FARM",
    "SAMPLE_SEASONS": "SEASONS",
    "SAMPLE_FRIENDS": "FRIENDS",
    "SAMPLE_DANCE": "DANCE",
    "SAMPLE_ANIMAL RACE": "ANIMAL RACE",
    "SAMPLE_BUMP": "BUMP",
    "SAMPLE_QUICK INTRO": "QUICK INTRO",
    "SAMPLE_STAR": "STAR",
    "SAMPLE_TEXT_KEY_CHARACTER_CAT": "CAT",
    "SAMPLE_TEXT_KEY_CHARACTER_STAR": "STAR",
    "SAMPLE_TEXT_KEY_CHARACTER_TEEN_GIRL": "TEEN",
    "SAMPLE_TEXT_KEY_CHARACTER_TEEN_BOY": "TEEN",
    "SAMPLE_TEXT_KEY_FARM_TAP_THEM": "TAP THEM",
    "SAMPLE_TEXT_KEY_PARTY_QUESTION": "PARTY?",
    "SAMPLE_TEXT_KEY_SOCCER_QUESTION": "OR SOCCER?",
    "SAMPLE_TEXT_KEY_GOAL": "GOAL!!",
    "SAMPLE_TEXT_KEY_UNDER_THE_SEA_FISH": "FISH",
    "SAMPLE_TEXT_KEY_UNDER_THE_SEA_SEAHORSE": "SEAHORSE",
    "SAMPLE_TEXT_KEY_UNDER_THE_SEA_STARFISH": "STARFISH",
    "SAMPLE_TEXT_KEY_FARM_PIG": "PIG",
    "SAMPLE_TEXT_KEY_FARM_HORSE": "HORSE",
    "SAMPLE_TEXT_KEY_FARM_CHICKEN": "CHICKEN",
    "SAMPLE_TEXT_KEY_FARM_BARN": "BARN",
    "SAMPLE_TEXT_KEY_SEASONS_SUMMER": "SUMMER",
    "SAMPLE_TEXT_KEY_SEASONS_FALL": "FALL",
    "SAMPLE_TEXT_KEY_SEASONS_WINTER": "WINTER",
    "SAMPLE_TEXT_KEY_SEASONS_SPRING": "SPRING",
    "SAMPLE_TEXT_KEY_FRIENDS_CAKE": "CAKE",
    "SAMPLE_TEXT_KEY_FRIENDS_SOCCER_BALL": "SOCCER BALL",
    "SAMPLE_TEXT_KEY_FRIENDS_CHILD": "CHILD",
    "SAMPLE_TEXT_KEY_FRIENDS_TABLE": "TABLE",
    "SAMPLE_TEXT_KEY_FRIENDS_SOCCER_NET": "SOCCER NET",
    "SAMPLE_TEXT_KEY_ANIMALRACE_ELEPHANT": "ELEPHANT",
    "SAMPLE_TEXT_KEY_ANIMALRACE_GIRAFFE": "GIRAFFE",
    "SAMPLE_TEXT_KEY_ANIMALRACE_MONKEY": "MONKEY",
    "SAMPLE_TEXT_KEY_DANCE_SCUBADIVER": "SCUBA DIVER",
    "SAMPLE_TEXT_KEY_DANCE_SNAKE": "SNAKE",
    "SAMPLE_TEXT_KEY_BUMP_YELLOW_DUCK": "YELLOW DUCK",
    "SAMPLE_TEXT_KEY_BUMP_BLUE_DUCK": "BLUE DUCK",
    "SAMPLE_TEXT_KEY_BUMP_GREEN_DUCK": "GREEN DUCK",
    "SAMPLE_TEXT_KEY_QUICKINTRO_FISH": "FISH",
    "SAMPLE_TEXT_KEY_QUICKINTRO_TOC": "TOC",
    "CHARACTER_CAT.SVG": "CAT",
    "CHARACTER_CAT2.SVG": "CAT WALKING",
    "CHARACTER_BLUE.SVG": "TIC",
    "CHARACTER_PURPLE.SVG": "TAC",
    "CHARACTER_RED.SVG": "TOC",
    "CHARACTER_DRAGON.SVG": "DRAGON",
    "CHARACTER_FAIRY.SVG": "FAIRY",
    "CHARACTER_WIZARD.SVG": "WIZARD",
    "CHARACTER_DOG.SVG": "DOG",
    "CHARACTER_RABBIT.SVG": "RABBIT",
    "CHARACTER_CHICKEN.SVG": "CHICKEN",
    "CHARACTER_PIG.SVG": "PIG",
    "CHARACTER_HORSE.SVG": "HORSE",
    "CHARACTER_ZEBRA.SVG": "ZEBRA",
    "CHARACTER_MONKEY.SVG": "MONKEY",
    "CHARACTER_ELEPHANT.SVG": "ELEPHANT",
    "CHARACTER_GIRAFFE.SVG": "GIRAFFE",
    "CHARACTER_CAMEL.SVG": "CAMEL",
    "CHARACTER_BUTTERFLY.SVG": "BUTTERFLY",
    "CHARACTER_FLY.SVG": "FLY",
    "CHARACTER_BAT.SVG": "BAT",
    "CHARACTER_BIRD.SVG": "BIRD",
    "CHARACTER_SNAKE.SVG": "SNAKE",
    "CHARACTER_LIZARD.SVG": "LIZARD",
    "CHARACTER_FROG.SVG": "FROG",
    "CHARACTER_DUCK.SVG": "DUCK",
    "CHARACTER_CRAB.SVG": "CRAB",
    "CHARACTER_SEAHORSE.SVG": "SEAHORSE",
    "CHARACTER_STARFISH.SVG": "STARFISH",
    "CHARACTER_FISH1.SVG": "FISH",
    "CHARACTER_FISH2.SVG": "FISH",
    "CHARACTER_WHALE.SVG": "WHALE",
    "CHARACTER_PENGUIN.SVG": "PENGUIN",
    "CHARACTER_POLARBEAR.SVG": "POLAR BEAR",
    "CHARACTER_GIRL1V2.SVG": "CHILD",
    "CHARACTER_GIRL2V2.SVG": "CHILD",
    "CHARACTER_GIRL3V2.SVG": "CHILD",
    "CHARACTER_BOY1V2.SVG": "CHILD",
    "CHARACTER_BOY2V2.SVG": "CHILD",
    "CHARACTER_BOY3V2.SVG": "CHILD",
    "CHARACTER_TEENGIRL1V2.SVG": "PERSON",
    "CHARACTER_TEENGIRL2V2.SVG": "PERSON",
    "CHARACTER_TEENGIRL3V2.SVG": "PERSON",
    "CHARACTER_TEENBOY1V2.SVG": "PERSON",
    "CHARACTER_TEENBOY2V2.SVG": "PERSON",
    "CHARACTER_TEENBOY3V2.SVG": "PERSON",
    "CHARACTER_BABY1V2.SVG": "BABY",
    "CHARACTER_BABY2V2.SVG": "BABY",
    "CHARACTER_BABY3V2.SVG": "BABY",
    "CHARACTER_MOTHERV2.SVG": "PERSON",
    "CHARACTER_FATHERV2.SVG": "PERSON",
    "CHARACTER_GRANDMOTHERV2.SVG": "PERSON",
    "CHARACTER_GRANDFATHERV2.SVG": "PERSON",
    "CHARACTER_GIRLV2.SVG": "CHILD",
    "CHARACTER_BOYV2.SVG": "CHILD",
    "CHARACTER_TEEN2V2.SVG": "PERSON",
    "CHARACTER_TEEN3V2.SVG": "PERSON",
    "CHARACTER_FARMER1V2.SVG": "RANCHER",
    "CHARACTER_FARMERV2.SVG": "RANCHER",
    "CHARACTER_BIKE2V2.SVG": "CYCLIST",
    "CHARACTER_BIKEV2.SVG": "CYCLIST",
    "CHARACTER_CAR2V2.SVG": "DRIVER",
    "CHARACTER_CAR1V2.SVG": "DRIVER",
    "CHARACTER_AEROPLANEV2.SVG": "PILOT",
    "CHARACTER_ASTRONAUTV2.SVG": "ASTRONAUT",
    "CHARACTER_INUITV2.SVG": "NORTHERNER",
    "CHARACTER_SCUBADIVERV2.SVG": "SCUBA DIVER",
    "CHARACTER_ROWBOATV2.SVG": "ROWER",
    "CHARACTER_GIRL1.SVG": "CHILD",
    "CHARACTER_GIRL2.SVG": "CHILD",
    "CHARACTER_GIRL3.SVG": "CHILD",
    "CHARACTER_BOY1.SVG": "CHILD",
    "CHARACTER_BOY2.SVG": "CHILD",
    "CHARACTER_BOY3.SVG": "CHILD",
    "CHARACTER_TEENGIRL1.SVG": "TEEN",
    "CHARACTER_TEENGIRL2.SVG": "TEEN",
    "CHARACTER_TEENGIRL3.SVG": "TEEN",
    "CHARACTER_TEENBOY1.SVG": "TEEN",
    "CHARACTER_TEENBOY2.SVG": "TEEN",
    "CHARACTER_TEENBOY3.SVG": "TEEN",
    "CHARACTER_BABY.SVG": "BABY",
    "CHARACTER_MOTHER.SVG": "MOTHER",
    "CHARACTER_FATHER.SVG": "FATHER",
    "CHARACTER_GRANDMOTHER.SVG": "GRANDMOTHER",
    "CHARACTER_GRANDFATHER.SVG": "GRANDFATHER",
    "CHARACTER_GIRL.SVG": "CHILD",
    "CHARACTER_BOY.SVG": "CHILD",
    "CHARACTER_TEEN2.SVG": "TEEN",
    "CHARACTER_TEEN3.SVG": "TEEN",
    "CHARACTER_FARMER1.SVG": "RANCHER",
    "CHARACTER_FARMER.SVG": "RANCHER",
    "CHARACTER_BIKE2.SVG": "CYCLIST",
    "CHARACTER_BIKE.SVG": "CYCLIST",
    "CHARACTER_CAR2.SVG": "DRIVER",
    "CHARACTER_CAR1.SVG": "DRIVER",
    "CHARACTER_AEROPLANE.SVG": "PILOT",
    "CHARACTER_ASTRONAUT.SVG": "ASTRONAUT",
    "CHARACTER_INUIT.SVG": "NORTHERNER",
    "CHARACTER_SCUBADIVER.SVG": "SCUBA DIVER",
    "CHARACTER_ROWBOAT.SVG": "ROWER",
    "CHARACTER_TREE1.SVG": "TREE",
    "CHARACTER_TREE3.SVG": "TREE",
    "CHARACTER_TREE4.SVG": "TREE",
    "CHARACTER_EVERGREEN.SVG": "TREE",
    "CHARACTER_WEED.SVG": "PLANT",
    "CHARACTER_PASTURE.SVG": "TALL GRASS",
    "CHARACTER_CACTUS.SVG": "CACTUS",
    "CHARACTER_DAFFODIL.SVG": "DAFFODILS",
    "CHARACTER_DAISY1.SVG": "DAISY",
    "CHARACTER_DAISY2.SVG": "DAISY",
    "CHARACTER_DAISY3.SVG": "DAISY",
    "CHARACTER_TULIP2.SVG": "TULIP",
    "CHARACTER_FLOWERS.SVG": "FLOWERS",
    "CHARACTER_APPLE.SVG": "APPLE",
    "CHARACTER_PEACH.SVG": "PEACH",
    "CHARACTER_MUSHROOM.SVG": "MUSHROOM",
    "CHARACTER_STAR.SVG": "STAR",
    "CHARACTER_STAR2.SVG": "STAR",
    "CHARACTER_STAR3.SVG": "STAR",
    "CHARACTER_SHOOTINGSTAR.SVG": "SHOOTING STAR",
    "CHARACTER_EARTH.SVG": "EARTH",
    "CHARACTER_PLANET.SVG": "PLANET",
    "CHARACTER_SUN.SVG": "SUN",
    "CHARACTER_MOON.SVG": "FULL MOON",
    "CHARACTER_CRESCENTMOON.SVG": "MOON",
    "CHARACTER_CLOUD1.SVG": "CLOUD",
    "CHARACTER_THUNDERCLOUD.SVG": "STORM CLOUD",
    "CHARACTER_TORNADO.SVG": "TORNADO",
    "CHARACTER_BARN.SVG": "BARN",
    "CHARACTER_FORT.SVG": "FORT",
    "CHARACTER_CASTLE.SVG": "CASTLE",
    "CHARACTER_IGLOO.SVG": "IGLOO",
    "CHARACTER_HOUSE1.SVG": "HOUSE",
    "CHARACTER_HOUSE.SVG": "HOUSE",
    "CHARACTER_HOUSE3.SVG": "HOUSE",
    "CHARACTER_HOUSE4.SVG": "HOUSE",
    "CHARACTER_APARTMENT.SVG": "APARTMENT",
    "CHARACTER_SCHOOL.SVG": "SCHOOL",
    "CHARACTER_SHOP.SVG": "SHOP",
    "CHARACTER_FENCE.SVG": "FENCE",
    "CHARACTER_MAILBOX.SVG": "MAILBOX",
    "CHARACTER_CAKE.SVG": "CAKE",
    "CHARACTER_BALL.SVG": "BALL",
    "CHARACTER_BASKETBALL.SVG": "BASKETBALL",
    "CHARACTER_SOCCERBALL.SVG": "SOCCER BALL",
    "CHARACTER_SOCCERNET.SVG": "SOCCER NET",
    "CHARACTER_BED.SVG": "BED",
    "CHARACTER_NIGHTTABLE.SVG": "NIGHT TABLE",
    "CHARACTER_STOOL.SVG": "STOOL",
    "CHARACTER_TABLE.SVG": "TABLE",
    "CHARACTER_CAR.SVG": "CAR",
    "CHARACTER_BUS.SVG": "BUS",
    "CHARACTER_SAILBOAT.SVG": "BOAT",
    "CHARACTER_BOAT2.SVG": "BOAT",
    "CHARACTER_ROCKET.SVG": "ROCKET",
    "BACKGROUND_FARM.SVG": "FARM",
    "BACKGROUND_PARK.SVG": "PARK",
    "BACKGROUND_SUBURBS.SVG": "SUBURBS",
    "BACKGROUND_CITY.SVG": "CITY",
    "BACKGROUND_LIBRARY.SVG": "LIBRARY",
    "BACKGROUND_CLASSROOM.SVG": "CLASSROOM",
    "BACKGROUND_THEATRE.SVG": "THEATRE",
    "BACKGROUND_GYM.SVG": "GYM",
    "BACKGROUND_GYM2.SVG": "GYM",
    "BACKGROUND_BEDROOM.SVG": "BEDROOM",
    "BACKGROUND_EMPTYROOM.SVG": "EMPTY ROOM",
    "BACKGROUND_SUMMER.SVG": "SUMMER",
    "BACKGROUND_FALL.SVG": "FALL",
    "BACKGROUND_WINTER.SVG": "WINTER",
    "BACKGROUND_SPRING.SVG": "SPRING",
    "BACKGROUND_CREEK.SVG": "RIVER",
    "BACKGROUND_LAKE.SVG": "LAKE",
    "BACKGROUND_WOODS.SVG": "WOODS",
    "BACKGROUND_BEACHDAY.SVG": "BEACH DAY",
    "BACKGROUND_BEACHSUNRISE.SVG": "BEACH SUNSET",
    "BACKGROUND_BEACHNIGHT.SVG": "BEACH NIGHT",
    "BACKGROUND_UNDERWATER.SVG": "UNDERWATER",
    "BACKGROUND_JUNGLE.SVG": "JUNGLE",
    "BACKGROUND_SAVANNAH.SVG": "SAVANNAH",
    "BACKGROUND_DESERT.SVG": "DESERT",
    "BACKGROUND_ARCTIC.SVG": "ARCTIC",
    "BACKGROUND_SPACE.SVG": "SPACE",
    "BACKGROUND_MOONBKG.SVG": "MOON",
    "BLOCK_DESC_GREEN_FLAG": "START ON GREEN FLAG",
    "BLOCK_DESC_ON_TAP": "START ON TAP {CHARACTER_NAME}",
    "BLOCK_DESC_ON_BUMP": "START ON BUMP {CHARACTER_NAME}",
    "BLOCK_DESC_MESSAGE_COLOR_ORANGE": "ORANGE",
    "BLOCK_DESC_ON_MESSAGE": "START ON {COLOR} MESSAGE",
    "BLOCK_DESC_SEND_MESSAGE": "SEND {COLOR} START MESSAGE",
    "BLOCK_DESC_MOVE_RIGHT": "MOVE RIGHT",
    "BLOCK_DESC_MOVE_LEFT": "MOVE LEFT",
    "BLOCK_DESC_MOVE_UP": "MOVE UP",
    "BLOCK_DESC_MOVE_DOWN": "MOVE DOWN",
    "BLOCK_DESC_TURN_RIGHT": "TURN RIGHT",
    "BLOCK_DESC_TURN_LEFT": "TURN LEFT",
    "BLOCK_DESC_HOP": "HOP",
    "BLOCK_DESC_GO_HOME": "GO HOME",
    "BLOCK_DESC_SAY": "SAY",
    "BLOCK_DESC_GROW": "GROW",
    "BLOCK_DESC_SHRINK": "SHRINK",
    "BLOCK_DESC_RESET_SIZE": "RESET SIZE",
    "BLOCK_DESC_HIDE": "HIDE",
    "BLOCK_DESC_SHOW": "SHOW",
    "BLOCK_DESC_PLAY_SOUND": "PLAY {SOUND_NAME}",
    "BLOCK_DESC_PLAY_SOUND_POP": "POP",
    "BLOCK_DESC_PLAY_RECORDED_SOUND": "PLAY RECORDED SOUND",
    "BLOCK_DESC_WAIT": "WAIT",
    "BLOCK_DESC_STOP": "STOP {CHARACTER_NAME}",
    "BLOCK_DESC_SET_SPEED": "SET SPEED",
    "BLOCK_DESC_REPEAT": "REPEAT",
    "BLOCK_DESC_END": "END",
    "BLOCK_DESC_REPEAT_FOREVER": "REPEAT FOREVER",
    "BLOCK_DESC_GO_TO_PAGE": "GO TO PAGE {PAGE}",
    "SHARING_BY_EMAIL": "SHARE BY EMAIL",
    "SHARING_BY_AIRDROP": "SHARE BY AIRDROP",
    "SHARING_EMAIL_SUBJECT": "SCRATCHJR PROJECT: {PROJECT_NAME}",
    "SHARING_EMAIL_TEXT": "CLICK THE ICON TO TRY MY SCRATCHJR PROJECT ON YOUR IPAD OR ANDROID TABLET!<BR><BR>IF YOU DON'T HAVE THE SCRATCHJR APP, YOU CAN <A HREF='HTTP://WWW.SCRATCHJR.ORG'>DOWNLOAD IT</A> FROM THE APPLE APP STORE OR THE GOOGLE PLAY STORE.<BR><BR>WITH SCRATCHJR, CHILDREN CAN CREATE THEIR OWN INTERACTIVE STORIES AND GAMES. TO LEARN MORE, SEE <A HREF='HTTP://WWW.SCRATCHJR.ORG'>SCRATCHJR.ORG</A>.",
    "FOR_PARENTS": "FOR PARENTS",
    "PARENTAL_GATE_EXPLANATION": "WHY ARE WE ASKING THIS? AN ADULT MUST APPROVE ONLINE SHARING.",
    "GRID_NUMBER": "{N, NUMBER}",
    "NEW_PROJECT_PREFIX": "PROJECT",
    "LIBRARY_CHARACTER": "CHARACTER",
    "LIBRARY_BACKGROUND": "BACKGROUND",
    "SAY_BLOCK_DEFAULT_ARGUMENT": "HI",
    "ALERT_BACK": "BACK",
    "ALERT_SAVING": "SAVING...",
    "SELECT_LANGUAGE": "SELECT LANGUAGE",
    "USAGE_QUESTION": "WHERE ARE YOU USING SCRATCHJR?",
    "USAGE_SCHOOL": "SCHOOL",
    "USAGE_HOME": "HOME",
    "USAGE_OTHER": "OTHER",
    "USAGE_NONE": "DON'T ASK AGAIN"
}
